<template>
    <div class="descr">
        <h2 class="descr-title">Какими профессиональными навыками обладают <span class="color">врачи ветеринары</span></h2>
        <p class="descr-text">
            Работа ветеринара более сложная, чем врача, лечащего людей. Дело в том, что животное не может подробно рассказать о том, какие ощущения испытывает и на
            что жалуется. Доктор прекрасно знает повадки, знаком с особенностями поведения пациентов и имеет хорошо развитую интуиции, что позволяет точно ставить<br>
            диагноз и назначать эффективное лечение в клинике или на дому.<br>
            Работа ветеринара также связана с наличием выдержки, стрессоустойчивости. Врач должен обладать быстрой реакцией и иметь хорошую память. Важно, что доктор не брезглив,
            имеет чувство такта.<br>
            Как правило, такой специалист работает в коллективе. На приеме с пациентами находится не только ветеринар, но и младший персонал, который помогает доктору заполнять
            бумаги, подает инструменты и расходные материалы для проведения тех или иных манипуляций.
        </p>
    </div>
</template>

<script setup>

</script>

<style lang="sass" scoped>
.descr
    margin: 0 112px 64px 112px
    &-title
        color: #000
        font-family: Segoe UI
        font-size: 20px
        font-weight: 700
        margin-bottom: 24px
    &-text
        color: #000
        font-family: Segoe UI
        font-size: 16px
.color
    color: #FF5A24
    font-family: Segoe UI
    font-size: 20px
    font-weight: 700
</style>