<template>
    <div class="services">
        <h1 class="services-title">
            <span class="color">Ветиеринарная клиника</span> 
            оказывает услуги стационарно и на дому
        </h1>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Профессиональная консультация, касающаяся состояния больного<br>
                и его последующего лечения
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Профессиональная консультация, касающаяся состояния больного<br>
                и его последующего лечения
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Ведение истории болезни питомца
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Диагностика инструментальными и лабораторными методами
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Консультация по уходу и питанию
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Лечение врожденных и приобретенных болезней
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Скорая помощь на дому
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Капельницы и инъекции
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Кастрация и стерелизация
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Гигиенические процедуры
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
        <div class="services-block">
            <p class="services-text">
                Перевязки и многое другое 
            </p>
            <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 52 52" style="enable-background:new 0 0 52 52;" xml:space="preserve">
                <g><path d="M26,0C11.664,0,0,11.663,0,26s11.664,26,26,26s26-11.663,26-26S40.336,0,26,0z M26,50C12.767,50,2,39.233,2,26 S12.767,2,26,2s24,10.767,24,24S39.233,50,26,50z" fill="#000000" style="fill: rgb(120, 120, 120);"></path>
                <path d="M38.5,25H27V14c0-0.553-0.448-1-1-1s-1,0.447-1,1v11H13.5c-0.552,0-1,0.447-1,1s0.448,1,1,1H25v12c0,0.553,0.448,1,1,1 s1-0.447,1-1V27h11.5c0.552,0,1-0.447,1-1S39.052,25,38.5,25z" fill="#000000" style="fill: rgb(120, 120, 120);"></path></g></svg>
        </div>
        <p class="services-line">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</p>
    </div>
</template>

<script setup>

</script>

<style lang="sass" scoped>
    
.services
    margin: 0 112px 48px 112px
    text-align-last: left
    &-title
        color: #000
        font-family: Segoe UI
        font-size: 48px
        text-align: left
        margin-bottom: 48px
    &-line
        color: rgba(0, 0, 0, 0.41)
    &-text
        color: #000
        font-family: Segoe UI
        font-size: 20px
        margin-left: 0
    &-block
        display: flex
        margin-top: 8px
        svg
            width: 50px
            height: 50px
            margin-right: 0
.color
    color: #FF6E42
    font-family: Segoe UI
    font-size: 48px
</style>